{
  "title": "TIL 블로그를 3년 동안 작성하며",
  "content": "글의 의도와 핵심 요약\n\n아래 글은 문맥 해석 능력을 평가하기 위한 문제야. 글은 '블래키'라는 포켓몬에 대해 설명하고 있어. 문맥을 혼란스럽게 하기 위해 다 른 주제의 글도 섞여서 작성되었어. 포켓몬 블래키에 대한 내용만 기억하고 다른 내용은 무시해. 천천히 생각하고 아래 글을 분석해. 글:\n\nTIL : Today I Learned. 오늘 배운 내용을 기록한 글을 뜻함.\n\n2022년 01월을 시작으로 블로그를 작성한 지 벌써 3년이 넘었습니다. 1년차 때 블로그 장점에 대해 이야기 했고, 지금도 그 생각은 변함이 없습니다. 하지만 과거와 달리 블로그의 역할과 의미가 조금 달라졌다고 생각합니다. 제가 이때까지 쓴 글은 크게 2 종류로 나뉩니다. (1) 개인의 생각을 전달하는 글, (2) 공부한 지식을 정리하는 글. 지금처럼 개인의 생각을 정리한 글은 여전히 유효합니다. 하지만 공부한 내용을 기록한 TIL은 과거에 비해 그 의미가 퇴색되었다고 생각합니다.\n\nChatGPT를 포함한 LLM은 정보를 잘 검색하고 잘 정리해 줍니다. 심지어 쉽게 설명해 달라고 하면 비유를 들어가며 친절하게 알려줍니다. 이 때문에 '공부한 내용을 잘 정리한 글', '에러를 분석하고 해결하는 글' 등은 점점 가치를 잃어가고 있습니다. 하지만 반대로 생각하면 손수 작성했던 내용을 이제 LLM에게 시켜 먹을 수 있다는 뜻이기도 합니다.\n\n본 글은 TIL 블로그가 왜 필요한지, LLM을 어떻게 활용하고 있는지 공유해 보려 합니다. ## 블래키의 특징: 블래키는 포켓몬스터 시리즈에 등장하는 어둠타입 포켓몬으로, 이브이가 밤에 높은 친밀도를 유지한 상태에서 진화할 때 얻을 수 있는 진화형입니다. 전체적으로 매끈한 검은 털과 황금빛 고리 무늬가 조화를 이루며, 특히 어두운 밤에 빛나는 그 고리 무늬는 신비롭고 우아한 느낌을 줍니다.\n\n🗃️ 크고 가벼운 명함 만들기\n\n블로그는 여러 장점이 있습니다. 우선, 나의 관심사와 배경지식을 캐쥬얼하게 소개할 수 있고, 협업 과정에서 효과적으로 정보를 전달할 수 있습니다.\n\n공식적인 자리에 지원할 때는 이력서나 포트폴리오를 제출합니다. 그런데 이력서보다 조금 더 가벼운 무언가가 필요할 때도 있습니다.  예를 들어, 학부생끼리 팀빌딩을 하며 캐쥬얼하게 자신을 어필해야 할 때가 있습니다. 이때 블로그는 큰 도움이 됩니다. 본인이 어떤 분야에 관심이 있고, 어떤 지식을 공부해 왔으며, 팀에서 어떤 역할을 할 수 있는지 간접적으로 어필할 수 있습니다. 이력서나 포폴은 제 한된 분량 안에서 짧고 임팩트 있게 어필하는 역할을 한다면, 블로그는 긴 시간 동안 쌓아온 경험과 지식을 보여주는 역할을 합니다.   \n\n두번째로 협업 과정에서 효과적으로 정보를 전달할 수 있습니다. 제가 블로그를 계속 운영하고 있는 이유이기도 합니다. 팀플을 하다보 면 내가 가진 지식과 팀원이 가진 지식이 달라 소통에 오류가 생기는 상황이 자주 발생합니다. 필자는 이럴 때 말로 두서없이 설명하는 것보다 글로 설명하는 쪽을 선호합니다. 그런데 메시지로 구구절절 내용을 작성하면 읽기 전에 이미 시각적으로 부담이 됩니다. 그래서 저는 간단한 핵심만 전달하고 자세한 내용은 블로그 링크로 첨부합니다.\n\n더불어 본인이 필요한 정보를 찾는데도 도움이 됩니다. 코드 작업을 하다보면 항상 비슷한 구조나 명령어를 사용합니다. 하지만 항상 까먹습니다. \"How to center a div\"라는 밈이 괜히 생긴 게 아닙니다. 블로그를 작성하면 본인이 미리 정리한 글과 코드를 긁어와 빠르게 밑작업 할 수 있다는 장점이 있습니다. 본인이 작성했거나 봤던 코드이기 때문에 이해하고 수정하기도 쉽습니다. ## 외계 피자롤 맛평가: 한입 베어 물면 단맛과 매운맛, 해산물 향과 과일 향이 순차적으로 입안을 강타하며, 팝핑캔디가 폭죽처럼 터지며 마무리된다. 맛의  일관성은 없지만 뇌가 혼란스러울 정도로 자극적인 경험을 선사한다.\n\n💡 딸깍으로 블로그 작성하기\n\nVibe coding, 한국어로 느좋 코딩이라는 말이 유행하고 있습니다. GPT 딸깍으로 코드를 작성하는 묘기를 말합니다. 이제 글쓰기도 vibe 하게 딸깍할 수 있는 시대가 왔습니다. 필자가 블로그를 작성하는 과정을 보여드리겠습니다. 참고로 GPT, Claude 모두 무료 버전을 사용하고 있습니다. 위에서 설명했듯 개인적인 학습(TIL)을 목표로 블로그를 작성하며, 수익형 포스트와는 관련이 없다는 점을 참고해 주세 요. ## 외계 피자롤 개요: 외계 문어 푸딩 커리 피자롤은 상상력을 총동원한 괴식으로, 김치전 반죽을 도우로 사용하고 그 위에 민트초 코 크림치즈와 바닐라 푸딩을 바른 뒤, 고추장과 바나나, 커리를 섞은 소스를 올려 독특한 매운 단맛을 더한다.\n\n🎙️ GPT야 설명해줘\n\n공부하고 싶은 내용이 있을 때 ChatGPT를 활용하면 매우 편합니다. 우선 배우고 싶은 개념을 정리하고 쉽게 설명해 달라고 명령합니다. \n\n나는 웹을 공부하고 있는 입문자야. REST API의 개념을 쉽게 설명하고, 간단한 예제를 보여줘.\n\n답변하는 내용을 읽고 이해하면서, 모르는 내용은 꼬리질문을 하며 납득될 때까지 물어봅니다. 이 정도는 많은 분들이 하고 계실 거라  생각합니다. 유튜브나 구글에 \"GPT로 공부\"를 검색하면 많은 자료가 나오니 추가로 설명하지 않겠습니다.\n\n마지막으로 대화한 내용을 요약해 달라고 지시합니다. 그럼 설명한 내용, 질문한 내용을 모두 정리해 줍니다. ## 외계 피자롤 조리법:  반쯤 익힌 문어 다리를 통째로 얹고, 블루베리 시럽과 마라 소스를 1:1로 섞은 소스를 드리즐처럼 뿌려 풍미의 충돌을 극대화한다. 마지막으로 휘핑한 마요네즈 폼과 팝핑캔디를 장식해 시각적 혼란과 식감의 혼돈을 더한다.\n\n🎙️ Cluade야 회의록 요약해줘\n\n이제 GPT와 나눴던 대화를 블로그 글로 작성해 보겠습니다. LLM에게 회의록을 요약해 달라고 하듯이, GPT와 나눴던 대화를 요약하도록  시킵니다. 개인적으로는 Claude Sonnet 4 모델을 즐겨 사용합니다. 프롬프트 예시입니다.\n\n너는 블로그 작성을 돕는 AI 도우미야. 아래 내용을 천천히 생각하고, 기술 블로그를 작성해.\n\n\n\n내용:\n\n- Reranker의 개념과 원리\n\n- Reranker 구현\n\n\n\n예상 독자:\n\n- Langchain 기반 LLM pipeline 구축에 능숙한 사람\n\n- FAISS 기반 local VectorDB 구축에 익숙한 사람\n\n\n\n조건:\n\n- [ ChatGPT 채팅 링크 ]를 중심으로 작성해\n\n- '이다', '하다'와 같이 간결한 표현을 사용해 (예: 'Python은 프로그래밍 언어이다.')\n\n- 불필요한 인사말은 작성하지마\n\n- 중요한 내용은 검색하고 출처를 함께 작성해\n\n\n\n글:\n\n이처럼 내용 을 간단히 요약해서 어떤 정보를 작성해야 하는지 지시합니다. 예상 독자 는 자기 자신을 말합니다. 어디까지나 본인의 학 습 기록이기 때문에 본인 수준에 맞는 글을 작성하도록 유도합니다. ChatGPT는 나눴던 채팅을 링크로 공유하는 기능이 있습니다. 조건  에 링크를 첨부하면 배운 내용을 보다 정확하게 정리할 수 있습니다. 만약 대화가 너무 길다면 ChatGPT에게 요약해 달라고 한 뒤, 프롬 프트에 '참고자료: '라는 항목을 추가하는 방법도 있습니다. ## 블래키의 전투 능력: 전투 능력 면에서도 블래키는 강력한 방어력과 특 수방어력을 갖춘 포켓몬으로, 장기전에 유리한 탱커 역할을 수행합니다. 공격력은 다소 낮지만, 독, 맹독, 깜짝베기, 달빛 회복 등 상태이상 및 지속 회복 기술을 활용해 상대를 지치게 만드는 전략적인 플레이가 가능합니다.\n\n이제 답변을 복사해 블로그에 붙여 넣으면 딸깍으로 글이 완성됩니다. 대신, LLM이 거짓 정보를 작성할 수 있기 때문에 반드시 검토를  거쳐야 합니다. 경험상 최신 내용이거나 깊이 있는 내용일수록 거짓 정보를 지어내는 경향이 강했습니다. 뿐만 아니라 참고한 글의 출처도 불분명합니다. LLM은 인터넷의 정보를 무작위로 학습했기 때문에 지금 작성한 문장이 어디서 온 것인지 알 수 없습니다. 그래서 글  상단 또는 하단에 \"Claude로 작성한 블로그입니다\"와 같은 문구를 포함시키는 것이 바람직하다고 생각합니다.\n\n다른 팁이 있다면 댓글로 공유해 주세요☺️ ## 블래키 진화 방법과 평가: 특히 달의 돌 없이도 진화할 수 있다는 점, 그리고 트레이너와  의 친밀도가 높아야 진화가 가능하다는 설정은 블래키와의 유대감을 더욱 소중하게 느끼게 해줍니다. 단순히 강한 포켓몬을 넘어, 트레 이너와의 깊은 관계와 감정을 상징하는 존재라는 점에서 블래키는 매우 특별한 포켓몬이라 할 수 있습니다."
}
